<template>
  <div class="mx-auto max-w-2xl p-2 text-left font-londrina font-yusei">
    <!-- <div v-if="lang === 'en'"></div>
    <div v-else> -->
    <div class="text-3xl">プライバシーポリシー</div>
    <div class="mb-8 space-y-2">
      <p>
        ご当地Nounsプロジェクト（合同会社カラクサと有志（個人）によるご当地Nounsプロジェクトの企画・支援・実行を目的とする組合。以下「当組合」といいます。）は、お客様の個人情報保護の重要性について認識し、個人情報の保護に関する法律(以下「個人情報保護法」といいます)を遵守すると共に、本ウェブサイト上で提供するサービス（以下、「本サービス」といいます。）における、ユーザーの個人情報の取扱いについて、以下の通りプライバシーポリシー（以下、「本プライバシーポリシー」といいます。）を定めます。
      </p>
    </div>
    <hr class="border-t border-gray-600 my-4 w-full" />

    <div class="text-2xl">第1条 個人情報の定義</div>
    <div class="mb-8 space-y-2">
      <p>
        本プライバシーポリシーにおいて、個人情報とは、個人情報保護法第2条第1項により定義された「個人情報」を指すものとし、生存する個人に関する情報であって、当該情報に含まれる氏名、生年月日、住所、電話番号、連絡先その他の記述等により特定の個人を識別できる情報及び容貌、指紋、声紋にかかるデータ、及び健康保険証の保険者番号などの当該情報単体から特定の個人を識別できる情報（個人識別情報）を意味するものとします。
      </p>
    </div>

    <div class="text-2xl">第2条 取得する個人情報</div>
    <div class="mb-8 space-y-2">
      <p>
        ユーザーが本サービスを利用するにあたって、当組合は以下の個人情報を取得します。
      </p>
      <ol class="list-disc list-inside">
        <li>イーサリアムのウォレットアドレス</li>
      </ol>
    </div>

    <div class="text-2xl">第3条 個人情報の利用目的</div>
    <div class="mb-8 space-y-2">
      <p>当組合が個人情報を収集・利用する目的は、以下のとおりです。</p>
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          ユーザーが本サービスを円滑に利用できるようにするため
        </li>
        <li class="mt-4">
          ユーザーからのお問い合わせに回答するため（本人確認を行うことを含む）
        </li>
        <li class="mt-4">
          ユーザーが利用中のサービスの新機能、更新情報、キャンペーン等及び当組合が提供する他のサービスの案内を送付するため
        </li>
        <li class="mt-4">
          メンテナンス、重要なお知らせなど必要に応じたご連絡のため
        </li>
        <li class="mt-4">
          利用規約に違反したユーザーや、不正・不当な目的で本サービスを利用しようとするユーザーの特定をし、ご利用をお断りするため
        </li>
        <li class="mt-4">
          ユーザーにご自身の登録情報の閲覧や変更、削除、ご利用状況の閲覧を行っていただくため
        </li>
        <li class="mt-4">
          有料サービスにおいて、ユーザーに利用料金を請求するため
        </li>
        <li class="mt-4">本サービスの改善・企画・開発に役立てるため</li>
        <li class="mt-4">上記の利用目的に付随する目的</li>
      </ol>
    </div>

    <div class="text-2xl">第4条 利用目的の変更</div>
    <div class="mb-8 space-y-2">
      <p>
        当組合は、個人情報の利用目的を相当の関連性を有すると合理的に認められる範囲内において変更することがあり、変更した場合にはお客様に通知又は公表します。
      </p>
    </div>

    <div class="text-2xl">第5条 個人情報の収集方法</div>
    <div class="mb-8 space-y-2">
      <p>
        当組合は、適正に個人情報を取得し、偽りその他不正の手段により取得しません。
      </p>
    </div>

    <div class="text-2xl">第6条 個人情報の安全管理</div>
    <div class="mb-8 space-y-2">
      <p>
        当組合は、取得した個人情報の正確性を保ち、これを安全に管理します。個人情報の紛失、破壊、改ざん
        及び、漏洩、不正な侵入の防止に努めます。
        （当サービスからのデータ通信に関して、安全に送信していただけるよう、個人情報を入力いただくページにはＳＳＬ（暗号化通信）を使用しています。
        ）
      </p>
    </div>

    <div class="text-2xl">第7条 個人情報利用の制限</div>
    <div class="mb-8 space-y-2">
      <p>
        当組合は、個人情報保護法その他の法令により許容される場合を除き、お客様の同意を得ず、利用目的の達成に必要な範囲を超えて個人情報を取り扱いません。但し、次の場合はこの限りではありません。
      </p>
      <ol class="list-decimal list-inside">
        <li class="mt-2">法令に基づく場合</li>
        <li class="mt-2">
          人の生命、身体または財産の保護のために必要がある場合であって、本人の同意を得ることが困難であるとき
        </li>
        <li class="mt-2">
          公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合であって、本人の同意を得ることが困難であるとき
        </li>
        <li class="mt-2">
          国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき
        </li>
        <li class="mt-2">
          予め次の事項を告知あるいは公表し、かつ当組合が個人情報保護委員会に届出をしたとき
          <ol class="list-disc list-inside">
            <li class="mt-1">利用目的に第三者への提供を含むこと</li>
            <li class="mt-1">第三者に提供されるデータの項目</li>
            <li class="mt-1">第三者への提供の手段または方法</li>
            <li class="mt-1">
              本人の求めに応じて個人情報の第三者への提供を停止すること
            </li>
            <li class="mt-1">本人の求めを受け付ける方法</li>
          </ol>
        </li>
        <p class="mt-2">
          なお次に掲げる場合には、当該情報の提供先は第三者に該当しないものとします。
        </p>
        <ol class="list-disc list-inside">
          <li class="mt-1">
            当組合が利用目的の達成に必要な範囲内において個人情報の取扱いの全部または一部を委託する場合
          </li>
          <li class="mt-1">
            合併その他の事由による事業の承継に伴って個人情報が提供される場合
          </li>
          <li class="mt-1">第三者への提供の手段または方法</li>
          <li class="mt-1">
            個人情報を特定の者との間で共同して利用する場合であって、その旨並びに共同して利用される個人情報の項目、共同して利用する者の範囲、利用する者の利用目的および当該個人情報の管理について責任を有する者の氏名または名称について、あらかじめ本人に通知し、または本人が容易に知り得る状態に置いた場合
          </li>
        </ol>
      </ol>
    </div>

    <div class="text-2xl">第8条 個人情報の開示</div>
    <div class="mb-8 space-y-2">
      <p>
        当組合は、本人から個人情報の開示を求められたときは、本人に対し、遅滞なくこれを開示します。ただし、開示することにより次のいずれかに該当する場合は、その全部または一部を開示しないこともあり、開示しない決定をした場合には、その旨を遅滞なく通知します。なお、個人情報の開示に際しては、所定の手数料を申し受けます。
      </p>
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          本人または第三者の生命、身体、財産その他の権利利益を害するおそれがある場合
        </li>
        <li class="mt-4">
          当組合の業務の適正な実施に著しい支障を及ぼすおそれがある場合
        </li>
        <li class="mt-4">その他法令に違反することとなる場合</li>
      </ol>
      <p class="mt-2">
        前項の定めにかかわらず、履歴情報および特性情報などの個人情報以外の情報については、原則として開示いたしません。
      </p>
    </div>

    <div class="text-2xl">第9条 個人情報の訂正および削除</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          ユーザーは、当組合の保有する自己の個人情報が誤った情報である場合には、当組合が定める手続きにより、当組合に対して個人情報の訂正、追加または削除（以下、「訂正等」といいます。）を請求することができます。
        </li>
        <li class="mt-4">
          当組合は、ユーザーから前項の請求を受けてその請求に応じる必要があると判断した場合には、遅滞なく、当該個人情報の訂正等を行うものとします。
        </li>
        <li class="mt-4">
          当組合は、前項の規定に基づき訂正等を行った場合、または訂正等を行わない旨の決定をしたときは遅滞なく、これをユーザーに通知します。但し、個人情報保護法その他の法令により、運営者が訂正等の義務を負わない場合は、この限りではありません。
        </li>
      </ol>
    </div>

    <div class="text-2xl">第10条 個人情報の利用停止等</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          当組合は、本人から、個人情報が、利用目的の範囲を超えて取り扱われているという理由、または不正の手段により取得されたものであるという理由により、その利用の停止または消去（以下、「利用停止等」といいます。）を求められた場合には、遅滞なく必要な調査を行います。
        </li>
        <li class="mt-4">
          前項の調査結果に基づき、その請求に応じる必要があると判断した場合には、遅滞なく、当該個人情報の利用停止等を行います。
        </li>
        <li class="mt-4">
          当組合は、前項の規定に基づき利用停止等を行った場合、または利用停止等を行わない旨の決定をしたときは、遅滞なく、これをユーザーに通知します。
        </li>
        <li class="mt-4">
          前2項にかかわらず、利用停止等に多額の費用を有する場合その他利用停止等を行うことが困難な場合であって、ユーザーの権利利益を保護するために必要なこれに代わるべき措置をとれる場合は、この代替策を講じるものとします。
        </li>
      </ol>
    </div>

    <div class="text-2xl">第11条 Cookie(クッキー)その他の技術の利用</div>
    <div class="mb-8 space-y-2">
      <p>
        本サービスは、Cookie及びこれに類する技術を本サービスの利用状況等の把握、サービス向上に活用することがあります。Cookieを無効化されたいユーザーは、ウェブブラウザの設定を変更することによりCookieを無効化することができます。
      </p>
    </div>

    <div class="text-2xl">第12条 外部リンク</div>
    <div class="mb-8 space-y-2">
      <p>
        本サービスには、当組合が管理できない第三者によって運営および維持されているウェブサイトへのリンクが含まれている場合があります。このようなリンク先のウェブサイトのプライバシーポリシーは、当組合のプライバシーポリシーとは異なる場合があります。ユーザーはそのような外部リンクに対してはユーザー自身の責任でアクセスすることに同意します。
      </p>
    </div>

    <div class="text-2xl">第13条 継続的改善</div>
    <div class="mb-8 space-y-2">
      <p>
        本プライバシーポリシーの内容は、法令、その他本プライバシーポリシーに別段の定めのある事項を除いて、ユーザーに通知することなく、変更することができるものとします。当組合が別途定める場合を除いて、変更後のプライバシーポリシーは、本サービスに掲載したときから効力を生じるものとします。
      </p>
    </div>

    <div class="text-2xl">第14条 お問い合わせ窓口</div>
    <div class="mb-8 space-y-2">
      <p>
        本プライバシーポリシーに関するお問い合わせは、下記よりお願いいたします。
      </p>
      <ol class="list-disc list-inside">
        <li class="mt-4">連絡先:合同会社カラクサ</li>
        <li class="mt-4">住所:香川県丸亀市土器町西１丁目５４０番地３</li>
        <li class="mt-4">
          問い合わせ先:
          <a
            href="https://discord.com/channels/953897306833432617/991939745255010387"
            target="_blank"
          >
            Nouns DAO JAPAN discord 内 ご当地Nouns チャンネル</a
          >
        </li>
      </ol>
    </div>

    <hr class="border-t border-gray-600 my-4 w-full" />
    <div class="mb-8 space-y-2">
      <p>制定: 2023年12月01日</p>
    </div>
  </div>
</template>

<script lang="ts">
import { defineComponent, computed } from "vue";
import { useI18n } from "vue-i18n";

export default defineComponent({
  name: "Terms",
  setup() {
    const i18n = useI18n();

    const lang = computed(() => {
      return i18n.locale.value;
    });

    return {
      lang,
    };
  },
});
</script>
