<template>
  <div class="mx-auto max-w-2xl p-2 text-left font-londrina font-yusei">
    <!-- <div v-if="lang === 'en'"></div>
    <div v-else> -->
    <div class="text-3xl">利用規約</div>
    <div class="mb-8 space-y-2">
      <p>
        この規約（以下「本規約」といいます）は、お客様（以下「ユーザー」といいます）が、ご当地Nounsプロジェクト（合同会社カラクサと有志（個人）によるご当地Nounsプロジェクトの企画・支援・実行を目的とする組合。以下「当組合」といいます。）が本ウェブサイト上で提供するサービス（関連するサービスを含み、以下「本サービス」といいます）をご利用頂く際に遵守すべき事項及び当組合とユーザー間の権利義務関係を定めるものです。ユーザーは、本規約に同意した上で本サービスをご利用ください。
      </p>
    </div>
    <hr class="border-t border-gray-600 my-4 w-full" />

    <div class="text-2xl">第1条 定義</div>
    <div class="mb-8 space-y-2">
      <p>本規約上で使用する用語の定義は、次に掲げるとおりとします。</p>
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          本サイト：本サービスのコンテンツが掲載されたウェブサイト
        </li>
        <li class="mt-4">
          本コンテンツ：本サービス上で提供される文字、音、静止画、動画、ソフトウェアプログラム、コード等の総称
        </li>
        <li class="mt-4">
          個人情報：生存する個人に関する住所、氏名、職業、電話番号等特定の個人を識別することのできる情報（他の情報と容易に照合することができ、それにより特定の個人を識別することができるものを含みます）。なお、個人情報の保護に関する法律に規定する個人情報と同義であり、関係法令が改正された場合には、その定義に従うものとします。
        </li>
        <li class="mt-4">登録情報：ユーザーが本サイトにて登録した情報の総称</li>
        <li class="mt-4">
          知的財産：発明、考案、意匠、著作物その他の人間の創造的活動により生み出されるもの、商標、商号その他事業活動に用いられる商品又は役務を表示するもの及び営業秘密その他の事業活動に有用な技術上又は営業上の情報
        </li>
        <li class="mt-4">
          知的財産権：特許権、実用新案権、意匠権、著作権、商標権その他の知的財産に関して法令により定められた権利又は法律上保護される利益に係る権利
        </li>
      </ol>
    </div>

    <div class="text-2xl">第2条 規約への同意</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          ユーザーは、本サービスの利用にあたり、本規約、当組合プライバシーポリシー（以下「プライバシーポリシー」といいます）その他当組合の定めるルールに従うものとします。本規約とその他当組合の定めるルールに不一致がある場合は、施行または改定日の新しい方が適用されます。
        </li>
        <li class="mt-4">
          ユーザーは、本サービスの利用を開始した時点で、本規約に同意したと見做されます。
        </li>
        <li class="mt-4">
          未成年者が本サービスを利用する場合、有料で販売されるアイテム、手数料を要する取引、その他有償で提供される一切のサービスの購入及び支払いを含む、本サービスの利用に係る一切の行為（本規約への同意を含みます。）について、親権者その他の法定代理人の同意を要するものとします。
        </li>
        <li class="mt-4">
          本規約の同意時に未成年であったユーザーが成年に達した後に本サービスを利用した場合、当該ユーザーは本サービスに関する一切の法律行為を追認したものとみなされます。
        </li>
      </ol>
    </div>

    <div class="text-2xl">第3条 規約の変更</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          当組合は、事前にユーザーに対し当組合が運営するウェブサイト上での掲載その他当組合が適当と判断する方法で周知することにより、ユーザーの承諾を得ることなく、いつでも、本規約の内容を変更することができるものとし、ユーザーはこれを異議なく承諾するものとします。
        </li>
        <li class="mt-4">
          変更後の本規約は、前項の方法により事前に周知した効力発生時期を経過した時点から効力が発生するものとします。
        </li>
        <li class="mt-4">
          ユーザーが変更された本規約の内容に同意しない場合、当該ユーザーの本サービスの利用を中止することがあります。変更後の本規約の効力発生後にユーザーが本サービスを継続して利用した場合、当該ユーザーは変更後の本規約の内容に同意したものとみなされます。
        </li>
      </ol>
    </div>

    <div class="text-2xl">第4条 アカウント登録</div>
    <div class="mb-8 space-y-2">
      <p>
        当組合は、ユーザーに対し、ユーザー固有のアカウント（以下、単に「アカウント」といいます。）を発行します。ユーザーは、自己のアカウントにより本サービスを利用するものとします。当組合は、ユーザーに対し、ユーザーとしての登録手続（以下「アカウント登録」といいます。）を設けることがあります。ユーザーは、自身のアカウントに関する情報に変更が生じた場合、当組合が定める方法により、速やかにその変更手続を行うものとします。
      </p>
    </div>

    <div class="text-2xl">第5条 ウォレット</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          ユーザーは本サービスの利用に当たり、当組合の指定するブラウザ及び暗号通貨（資金決済法上の暗号資産を含みますが、これに限りません。）の保管機能（以下「ウォレット」といいます。）を利用するものとします。
        </li>
        <li class="mt-4">
          ウォレットにおける暗号通貨の管理は、ユーザー自身の端末機器上の記憶領域を利用して行われます。当組合は、オンライン上での管理手段を提供しません。ウォレットへの入金及びウォレットからの出金は、当組合所定の時期及び方法により行われるものとします。
        </li>
      </ol>
    </div>

    <div class="text-2xl">第6条 アカウント・ウォレット等の管理</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          ユーザーは、本サービスを利用するにあたり、パスワード(ログインパスワード、API
          シークレット、秘密鍵、認証コード、暗証番号その他いかなる名称のものを含みます。)、アカウントID(ウォレットアドレス、API
          キーその他いかなる名称のものを含みます。)その他端末機器等(総称して、以下｢アカウント等｣といいます。)を第三者に使用させ、又は第三者と共有してはならないものとします。当組合は、ユーザーの端末機器及び秘密鍵を管理しません。
        </li>
        <li class="mt-4">
          ユーザーは、本サービスの利用にあたり、自己のアカウント等を、自己の責任において管理するものとし、自己のアカウント等を使用してなされた行為について、一切の責任を負うものとします。
        </li>
        <li class="mt-4">
          当組合は、ユーザーのアカウント等を使用してなされた行為について、その実際の利用者が誰であるかを問わず、すべて、当該アカウント等が付与されたユーザーによる行為、又は当該アカウント等を管理するユーザーによる行為とみなします。
        </li>
        <li class="mt-4">
          当組合は、ユーザーの使用する端末機器の故障、紛失、第三者からのマルウェア、スパイウェア、ウィルス、ハッキング・クラッキング等による攻撃、アカウント等の管理不備及び使用上の過誤、又は第三者によるアカウント等の使用等により、ユーザーがウォレット内の暗号通貨の喪失、使用不能を含む損害を蒙った場合であっても、当組合に故意又は重過失ある場合を除き、一切の責任を負いません。
        </li>
        <li class="mt-4">
          ユーザーは、自己のアカウント等が第三者により不正に利用されるおそれがある場合、速やかに当組合に通知するとともに、当該不正利用を回避するため必要な措置をとるものとします。
        </li>
        <li class="mt-4">
          当組合は、ユーザーが自己のアカウント等を紛失又は失念したことにより、ユーザーに生じうる不利益(ウォレット内の暗号通貨その他本サイトににおいて実現される一切の状態及び本サイトに関連するブロックチェーン上に記録された情報が失われることを含みます。)について、一切の責任を負いません。
        </li>
        <li class="mt-4">
          ユーザーは、ユーザーの使用する端末機器、秘密鍵及びパスワードの一つでも欠けた場合、ユーザーはウォレットを使用することが不可能となること、並びに、当組合が当該ウォレットに関して何らかの救済を行うことが不可能であることを予め了解するものとします。
        </li>
      </ol>
    </div>

    <div class="text-2xl">第7条 サービスの内容変更と中断等の措置</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          当組合は、本サービス及び本サービスを利用して提供される一切のサービスについて、本サービスを適正かつ円滑に運営するためユーザーに通知することなく、いつでも任意に内容を変更できるものとします。
        </li>
        <li class="mt-4">
          当組合は、以下の各号のいずれかに該当する場合には、ユーザーに通知することなく、本サービスの全部又は一部の中断等の措置を講じることができるものとします。
          <p>
            ①本サービスに係るコンピュータシステムの点検又は保守作業を定期的又は緊急に行う場合
          </p>
          <p>
            ②コンピュータ、通信回線、その他の設備等が事故等により停止した場合
          </p>
          <p>
            ③火災、停電、天災地変などの不可抗力により本サービスの運営に支障が生じた場合
          </p>
          <p>
            ④ハッキングその他の方法により当組合が管理するシステムに異常が生じた場合
          </p>
          <p>⑤その他、当組合が利用停止又は中断が必要と判断した場合</p>
        </li>
        <li class="mt-4">
          本条に基づく当組合の措置について、ユーザーは異議を申し立てることはできず、これによってユーザーに生じたいかなる損害についても、当組合は一切の責任を負わないものとします。
        </li>
      </ol>
    </div>

    <div class="text-2xl">第8条 サービスの終了・退会</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          当組合は、当組合の都合により、本サービスの提供を終了（サービスの同一性を維持しないかたちで、本サービスの内容や仕様の全部又は一部について、異なる内容や仕様に変更することを含みます）することができます。この場合、当組合はユーザーに事前に通知するよう努めるものとします。
        </li>
        <li class="mt-4">
          ユーザーは、本サービス所定の手続きに従い、本サービスからいつでも退会することができます。
        </li>
        <li class="mt-4">
          当組合が本サービスを終了する場合、またユーザーが本サービスから退会する場合は、本サービスにおいてユーザーに関連する一切のデータは削除されるものとします。ただし、当組合による本サービス終了の際は、ユーザーが所有しているサービス内通貨を本サービス外に送信できるよう、一定の期間を設けるものとします。
        </li>
        <li class="mt-4">
          本条に基づく当組合の措置について、ユーザーは異議を申し立てることはできず、これによってユーザーに何らかの損害が生じたとしても、当組合は一切の責任を負わないものとします。
        </li>
      </ol>
    </div>

    <div class="text-2xl">第9条 個人情報等の取り扱い</div>
    <div class="mb-8 space-y-2">
      <p>
        個人情報及び登録情報については、プライバシーポリシーに則り、適正に取り扱います。
      </p>
    </div>

    <div class="text-2xl">第10条 費用の負担</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          本サービスの利用にあたって必要な機器・ソフトウェアの購入・導入・維持の費用、データ利用料金等の通信料金、電気料金その他一切の費用は、ユーザーが自己の責任において支払うものとします。
        </li>
        <li class="mt-4">
          当組合は、本サービスの利用環境に関し推奨環境を提示することはありますが、当該環境の整備及び費用を一切負担しません。
        </li>
      </ol>
    </div>

    <div class="text-2xl">第11条 知的財産権</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          本サービス、本サイト及び本コンテンツ上で当組合が提供する文章、画像、動画、ロゴ、デザイン、構成、プログラム、ソースコードその他一切のコンテンツの知的財産権については、当組合又は当該権利等を正当に有する第三者に帰属するものとします。ユーザーは、いかなる理由によっても当組合又は当組合にライセンスを許諾している者の知的財産権を侵害するおそれのある行為（逆アセンブル、逆コンパイル、リバースエンジニアリングを含みますが、これに限定されません）をしないものとします。
        </li>
        <li class="mt-4">
          ユーザーが、本サービス上に投稿その他の方法で送信したコンテンツ（静止画、動画、文字情報その他一切の情報）に関する著作権については当該ユーザーに帰属するものとします。ただし、利用者は、コンテンツの送信時に、当組合に対し、日本国内外において、当該コンテンツを無償かつ非独占的に使用することを許諾します。
        </li>
      </ol>
    </div>

    <div class="text-2xl">第12条 禁止行為</div>
    <div class="mb-8 space-y-2">
      <p>
        本サービスの利用に際し、当組合は、ユーザーに対し、以下の各号に掲げる行為、これらを助長する行為又はこれらに該当するおそれのある行為を禁止します。
      </p>
      <ol class="list-decimal list-inside">
        <li class="mt-4">本規約、法令、又は公序良俗に違反する行為</li>
        <li class="mt-4">当組合又は第三者の知的財産権を侵害する行為</li>
        <li class="mt-4">
          当組合又は第三者の名誉・信用を毀損又は不当に差別若しくは誹謗中傷する行為
        </li>
        <li class="mt-4">
          当組合又は第三者の財産を侵害する行為、又は侵害する恐れのある行為
        </li>
        <li class="mt-4">当組合又は第三者に経済的損害を与える行為</li>
        <li class="mt-4">当組合又は第三者に対する脅迫的な行為</li>
        <li class="mt-4">
          コンピューターウィルス、有害なプログラムを送信する行為
        </li>
        <li class="mt-4">
          本サービス用インフラ設備に対して過度な負担をかける行為
        </li>
        <li class="mt-4">
          当組合ウェブサイトのサーバーやシステム、セキュリティに攻撃する行為
        </li>
        <li class="mt-4">
          当組合提供のインターフェース以外の方法で本サービスにアクセスをする行為
        </li>
        <li class="mt-4">
          営業、宣伝、広告、勧誘、その他営利を目的とする行為（ただし、当組合が同意したものを除く）
        </li>
        <li class="mt-4">
          他のユーザーのアカウントを使用して本サービスを利用する行為、又は他のユーザーの名前、名称を用いる等、他人になりすまして本サービスを利用する行為
        </li>
        <li class="mt-4">
          犯罪収益に関する行為、テロ資金供与に関する行為、又はその疑いがある行為
        </li>
        <li class="mt-4">
          本サービス外において、アカウント又は本コンテンツを第三者に有償で貸与、譲渡、売買等をする行為
        </li>
        <li class="mt-4">
          BOT、チートツール等の外部プログラム（本サービスの利用により得られる結果を、当組合の意図しない形で操作する外部ツールを含みますが、それに限られません。）を作成し、頒布し、利用する行為
        </li>
        <li class="mt-4">
          前号の外部プログラムの利用により第三者が得た結果を、自らのために利用する行為
        </li>
        <li class="mt-4">
          本条の禁止行為をおこなう目的で、本サービスを複数アカウントにより使用する行為
        </li>
        <li class="mt-4">前各号の他、当組合が不適切と判断する行為</li>
      </ol>
    </div>

    <div class="text-2xl">第13条 免責・損害賠償</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          当組合は、ユーザーの本サービスの利用環境について一切関与せず、また一切の責任を負わないものとします。
        </li>
        <li class="mt-4">
          当組合は、本サービスがユーザーの特定の目的に適合すること、期待する機能・商品的価値・正確性・有用性を有すること、ユーザーによる本サービスの利用がユーザーに適用のある法令又は業界団体の内部規則等に適合すること、及び不具合が生じないことについて、何ら保証しないものとします。
        </li>
        <li class="mt-4">
          当組合は、本サービスが全ての情報端末に対応していることを保証するものではなく、本サービスの利用に供する情報端末のＯＳのバージョンアップ等に伴い、本サービスの動作に不具合が生じる可能性があることにつき、ユーザーはあらかじめ了承するものとします。当組合は、かかる不具合が生じた場合に当組合が行うプログラムの修正等により、当該不具合が解消されることを保証しないものとします。
        </li>
        <li class="mt-4">
          当組合は、本サービスを利用したことにより直接的又は間接的にユーザーに発生した損害について、一切賠償責任を負わないものとします。
        </li>
        <li class="mt-4">
          当組合は、ユーザーその他の第三者に発生した機会の逸失、業務の中断その他いかなる損害（間接損害や逸失利益を含みます）に対して、当組合がかかる損害の可能性を事前に通知されていたとしても、一切賠償責任を負わないものとします。
        </li>
        <li class="mt-4">
          第１項乃至前項の規定は、当組合に故意若しくは重過失が存在する場合又はユーザーが消費者契約法上の消費者に該当する場合には当該ユーザーとの関係では適用しません。
        </li>
        <li class="mt-4">
          前項が適用される場合であっても、当組合は、過失（重過失を除きます）による行為によってユーザーに生じた損害のうち、特別な事情から生じた損害については、賠償する責任を負わないものとします。
        </li>
        <li class="mt-4">
          本サービスの利用に関し当組合がユーザーに対し損害賠償責任を負う場合、当組合は、当該損害が発生した月にユーザーから受領した利用額を限度として賠償責任を負うものとします。
        </li>
        <li class="mt-4">
          当組合の責に帰さない事由によるユーザーと他のユーザーとの間の紛争及びトラブルについて、当組合は一切責任を負わないものとします。ユーザーと他のユーザーでトラブルになった場合でも、両者同士の責任で解決するものとし、ユーザーは当組合に一切の請求をしないものとします。
        </li>
        <li class="mt-4">
          ユーザーは、本サービスの利用に関連し、他のユーザーに損害を与えた場合又は第三者との間に紛争が生じた場合、自己の費用（弁護士費用を含みます）と責任において、かかる損害を賠償又はかかる紛争を解決するものとし、当組合は一切の関与及び費用負担をしないものとします。
        </li>
        <li class="mt-4">
          ユーザーの行為により、第三者から当組合が損害賠償等の請求をされた場合には、当該ユーザーの費用（弁護士費用を含みます）と責任において、これを解決するものとします。当組合が、当該第三者に対して、損害賠償金を支払った場合には、ユーザーは、当組合に対して当該損害賠償金を含む一切の費用（弁護士費用及び逸失利益を含みます）を支払うものとします。
        </li>
        <li class="mt-4">
          ユーザーが本サービスの利用に関連して当組合に損害を与えた場合、ユーザーの費用と責任において当組合に対して損害を賠償（弁護士費用及び逸失利益を含みます）するものとします。
        </li>
        <li class="mt-4">
          他の利用者または第三者から投稿についての削除依頼があった時、当組合の判断で削除の可否を決定できるものとし、当該判断により生じた一切の責任について、当組合は責任を負わないものとします。
        </li>
        <li class="mt-4">
          本サービスで他の利用者が投稿した情報の正確性について、当組合は保証しません。当組合は、本サービスに掲載されている情報についての紛争及びトラブルについて一切の責任を負いません。
        </li>
        <li class="mt-4">
          当組合を組織する法人・個人は、いかなる状況・理由においてもユーザーに対して一切責任を負いません。またユーザーは理由の如何にかかわらず当組合を組織する法人・個人に対して訴訟、損害賠償請求を含む責任追求や請求を行わないことを誓約し、これらの権利を将来にわたって永久に放棄します。
        </li>
      </ol>
    </div>

    <div class="text-2xl">第14条 秘密保持</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          本規約において「秘密情報」とは、本規約又は本サービスに関連して、ユーザーが、当組合より書面、口頭若しくは記録媒体等により提供若しくは開示されたか又は知り得た、当組合の技術、営業、業務、財務、組織、その他の事項に関する全ての情報を意味します。ただし、以下の各号の情報については、秘密情報から除外するものとします。
        </li>
        <p>
          ①当組合から提供若しくは開示がなされたとき又は知得したときに、既に一般に公知となっていた又は既に知得していたもの
        </p>
        <p>
          ②当組合から提供若しくは開示又は知得した後、自己の責に帰さない事由により刊行物その他により公知となったもの
        </p>
        <p>
          ③提供又は開示の権限のある第三者から秘密保持義務を負うことなく適法に取得したもの
        </p>
        <p>④秘密情報によることなく単独で開発したもの</p>
        <li class="mt-4">
          ユーザーは、秘密情報を機密として保持し、本サービスの利用の目的のみに利用するとともに、当組合の書面による承諾なしに第三者に当組合の秘密情報を提供、開示又は漏洩しないものとします。
        </li>
        <li class="mt-4">
          第2項の定めにかかわらず、ユーザーは、法律、裁判所又は政府機関の命令、要求又は要請に基づき、秘密情報を必要最小限の範囲で開示することができます。ただし、当該命令、要求又は要請があった場合、速やかにその旨を当組合に通知しなければなりません。
        </li>
        <li class="mt-4">
          ユーザーは、秘密情報を記載した文書又は電磁的記録等を複製する場合には、事前に当組合の書面による承諾を得ることとし、複製物の管理については第2項に準じて厳重に行うものとします。
        </li>
        <li class="mt-4">
          ユーザーは、当組合から求められた場合にはいつでも、遅滞なく、当組合の指示に従い、秘密情報並びに秘密情報を記載又は包含した書面その他の記録媒体及びその全ての複製物の使用を中止し、返却又は廃棄しなければならないものとします。
        </li>
      </ol>
    </div>

    <div class="text-2xl">第15条 広告及びリンクの掲載について</div>
    <div class="mb-8 space-y-2">
      <p>
        ユーザーは、本サービス上にあらゆる広告、及びリンクされた他のサービスが含まれる場合があることを理解しこれを承諾したものとみなします。本サービスで掲載された広告、及びリンクされた他のサービスの内容につき、当組合は一切の責任を負いません。本サービス上の広告、及びリンクされた他のサービスの形態や範囲は、当組合によって随時変更されます。
      </p>
    </div>

    <div class="text-2xl">第16条 反社会的勢力の排除</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          ユーザーは、現在かつ将来にわたり、反社会的勢力（暴力団、暴力団員、暴力団準構成員、暴力団関係企業、総会屋等、社会運動等標榜ゴロ、又は特殊知能暴力集団等、その他これらに準ずる者をいいます）に該当しないこと、また暴力的な要求行為、法的な責任を超えた不当な要求行為、取引に関して脅迫的な言動をし暴力を用いる行為、風説を流布し偽計を用い又は威力を用いて信用を毀損し又は業務を妨害する行為、その他これらに準ずる行為を行わないことを、現在及び将来にわたって表明するものとします。
        </li>
        <li class="mt-4">
          当組合は、ユーザーが前項のいずれかに該当すると判断した場合、何らの事前通知を要さず、当該ユーザーのアカウント削除その他必要な一切の措置を講ずるものとします。当該ユーザーは、当組合による当該措置に対して、損害賠償請求その他一切の権利を行使することはできないものとします。
        </li>
      </ol>
    </div>

    <div class="text-2xl">第17条 権利義務等の譲渡等除</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          ユーザーは、本規約等について、本規約等上の地位及びこれらに基づく一切の権利義務を、当組合の書面による事前の承諾なく、第三者に譲渡、貸与、又は担保に供することはできません。
        </li>
        <li class="mt-4">
          当組合は、本サービスに関する事業を合併、会社分割、事業譲渡その他の事由により第三者に承継させる場合には、当該事業の承継に伴い、本規約等上の地位、本規約等に基づく権利義務及びユーザー情報を当該事業の承継人に譲渡することができるものとし、ユーザーは、かかる譲渡について本項において予め同意したものとします。
        </li>
      </ol>
    </div>

    <div class="text-2xl">第18条 存続規定</div>
    <div class="mb-8 space-y-2">
      <p>
        第8条第3項及び第4項、第11条、第13条第11項乃至13項、15項、第14条、第17条、本条並びに第21条までの規定は、ユーザーの本サービスの利用終了後又は当組合による本サービスの提供終了後も有効に存続するものとします。
      </p>
    </div>

    <div class="text-2xl">第19条 分離可能性</div>
    <div class="mb-8 space-y-2">
      <p>
        本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効又は執行不能と判断された場合であっても、本規約の残りの規定及び一部が無効又は執行不能と判断された規定の残りの部分は、継続して効力を有するものとします。
      </p>
    </div>

    <div class="text-2xl">第20条 準拠法、管轄裁判所</div>
    <div class="mb-8 space-y-2">
      <ol class="list-decimal list-inside">
        <li class="mt-4">
          本規約の有効性、解釈及び履行については、日本法に準拠し、日本法に従って解釈されるものとします。
        </li>
        <li class="mt-4">
          当組合とユーザー等との間での論議・訴訟その他一切の紛争については、訴額に応じて、東京簡易裁判所又は東京地方裁判所を専属的合意管轄裁判所とします｡
        </li>
      </ol>
    </div>

    <div class="text-2xl">第21条 協議解決</div>
    <div class="mb-8 space-y-2">
      <p>
        当組合及びユーザーは、本規約等に定めのない事項又は本規約等の解釈に疑義が生じた場合には、互いに信義誠実の原則に従って協議の上速やかに解決を図るものとします。
      </p>
    </div>

    <div class="text-2xl">第22条 特約</div>
    <div class="mb-8 space-y-2">
      <p>
        当組合はご当地Nounsの企画・運営を担いますが、NFTの販売は当組合では行わず、合同会社カラクサの名義と計算、責任において実行されます。ユーザーはこの点を十分に理解し「重要事項説明資料」に記載の内容を確認・承諾し、異議を述べないことといたします。
      </p>
    </div>
    <hr class="border-t border-gray-600 my-4 w-full" />
    <div class="mb-8 space-y-2">
      <p>制定: 2023年12月01日</p>
    </div>
  </div>
  <!-- </div> -->
</template>

<script lang="ts">
import { defineComponent, computed } from "vue";
import { useI18n } from "vue-i18n";

export default defineComponent({
  name: "Terms",
  setup() {
    const i18n = useI18n();

    const lang = computed(() => {
      return i18n.locale.value;
    });

    return {
      lang,
    };
  },
});
</script>
